# Як ми знаємо, ключ у словнику має бути унікальним, тоді як значення його ні.
# Реалізуйте функцію lookup_key для пошуку всіх ключів за значенням у словнику.
# Першим параметром у функцію ми передаємо словник, а другим — значення, що хочемо знайти.
# Таким чином, результат може бути як список ключів, так і порожній список, якщо ми нічого не знайдемо.
data = {"First": 1, "Second": 2}


def lookup_key(data, value):
    my_list = list()
    for d, v in data.items():
        if v == value:
            my_list.append(d)

    print(my_list)


lookup_key("First", 1)
